# pandas的資料結構

Series 和 DataFrame 是非常基本且重要

In [337]:
import pandas as pd #常用好辨識
from pandas import Series, DataFrame #不建議

## Series
- 一維陣列的物件, 包含一個 numpy ndarray (值)及一個資料標籤 index
- 類似有次序, 固定長度的字典型態, 因為index和值都是成對出現

In [338]:
obj=pd.Series(data=[4,7,-5,3]) #一旦由list or tuple輸入形成pd物件之後, 資料變成 numpy ndarray
obj

0    4
1    7
2   -5
3    3
dtype: int64

### 透過Series的values 和index的屬性, 分別取得值和index陣列

In [339]:
obj.values # return <class 'numpy.ndarray'>
obj.index  # default: RangeIndex(start=0, stop=4, step=1)

RangeIndex(start=0, stop=4, step=1)

### 修改index陣列

In [340]:
obj2 = pd.Series(data=obj.values, index=list('dbac'))
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

### 取值

In [341]:
obj2['a']
mask = ['c','a','d']
obj2[mask]

c    3
a   -5
d    4
dtype: int64

### 布林陣列過濾資料

In [342]:
mask = obj2 > 0
obj2[mask]

d    4
b    7
c    3
dtype: int64

### 純量乘法

In [343]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

### 數學函式運算
- Numpy 函式或類似Numpy 運算,都會保存其index和值的連結關係

In [344]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [345]:
'b' in obj2
# 'e' in obj2

True

### dict型態來建立Series物件
- key的部分就是index, value的部分就是資料值

In [346]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

### 修改index
- Series中的資料以index來決定排序, 因此index另外傳入時, Series的資料順序也會改變

In [347]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### 偵測遺失資料

In [348]:
#'NaN': not a number, 'NA': Not available
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [349]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [350]:
obj4.isnull() #Series物件本身也有同樣的實例方法
#obj4.notnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

### 運算後自動對齊
- elementwise運算
- dtype也會自動統一

In [351]:
print(obj3)
print(obj4)
obj3+obj4 #比擬資料庫結合(join)動作

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### name屬性
- 可針對Series 物件和它內部index命名

In [352]:
print(obj4)
obj4.name = 'population'
obj4.index.name= 'state'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### 更改index

In [353]:
print(obj)
name = ['Bob','Steve', 'Jeff', 'Ryan']
obj.index = name
obj

0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## $$ DataFrame $$
- 每個欄位可能是不同型態(數字, 字串, 布林)
- 二維形式
- 想像是一個dict物件(data), 是由許多Series物件組成的

In [354]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada','Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data) #index自動派定
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### 顯示某幾列
- 遇到大型DataFrame,不需全部都顯示

In [355]:
frame.head()    #default:前五筆記錄
frame.tail()    #default:後五筆紀錄
frame.head(3)   #前三筆紀錄
frame.sample(2) #亂數取樣數

    state  year  pop
4  Nevada  2002  2.9
2    Ohio  2002  3.6

### 欄位指定
- 欄位順序同時也會按指定順序排好(由左到右)

In [356]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [357]:
#若欄位不在data的話, 則會以NaN值的方法顯示
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

### 屬性呼叫欄位(行標籤)

In [358]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

### 屬性呼叫索引(列標籤)

In [359]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

### 屬性呼叫資料值

In [360]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### dict 方法顯示特定欄位

In [361]:
print(frame2['state'])

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

### 屬性呼叫某欄位

In [362]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

### 修改某欄位值

In [363]:
frame2['debt'] = 16.5 #常數值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [364]:
frame2['debt'] = np.arange(6) #陣列值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [365]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five']) #Series物件
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [366]:
mask = (frame2.state =='Ohio')
frame2['eastern'] = mask  # boolean mask
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

### 用frame2.eastern這樣的語法無法建立新欄位

### 刪除行欄位

In [367]:
del frame2['eastern']

In [368]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

### dict的巢式結構
- 外層的dict key解讀為欄位標籤
- 內層的dict key解讀為索引標籤

In [369]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

### 欄位、索引標籤互換

In [370]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [371]:
frame3.index.name='year';frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [372]:
frame2.values #如果DataFrame的欄位dtype不同的話,哪就會選定可以滿足所有欄位的dtype

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# $$重要功能$$

### 重作索引(reindex)

In [373]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [374]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [375]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) #fillna值

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [376]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [377]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### 對列進行reindex

In [378]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'],
                     columns= ['Ohio', 'Texas', 'California'])
print(frame)
frame2 = frame.reindex(list('abcd'))
frame2

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

### 對欄進行reindex

In [379]:
print(frame)
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 指定軸刪除資料

In [380]:
obj = pd.Series(np.arange(5.), index=list('abcde'))
print(obj)
obj.drop('c')

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [381]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

### 兩軸都可以指定index來刪除資料

In [382]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [383]:
data.drop(['Colorado','Ohio']) # default: axis=0

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [384]:
data.drop(['two'], axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### inplace 就地植入，不建立新物件 (化學變化)

In [385]:
obj.drop('c', inplace=True) # default:(inplace=False), (物理變化)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### 索引、選擇和過濾

#### Series做索引和numpy array的索引很類似，差別在Series可用index值，不用一定要是整數

In [391]:
## Series和numpy的索引很類似
obj = pd.Series(np.arange(4.), index=list('abcd'))
print(obj)
obj['b']

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

1.0

In [392]:
obj[1]

1.0

In [393]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [ ]:
obj[['']]